# -------------------------
# ループ
# -------------------------
for i in range(3):
    print(i)
# range(n) は 0 から始まる
# n は 含まれない

total = 0
for i in range(1, 4):
    total += i
print(total)
# for文の外でprintしてるので、答えは1つ
# 処理の流れ👇
# 最初：total = 0
# i = 1 → total = 0 + 1 = 1
# i = 2 → total = 1 + 2 = 3
# i = 3 → total = 3 + 3 = 6
# 最後に print(total) → 6

# -------------------------
# リスト
# -------------------------
nums = [10, 20, 30]
print(nums[0]) # 10
print(nums[-1]) # 30 後ろから

# -------------------------
# リスト＋ループ
# -------------------------
nums = [1, 2, 3]
for n in nums:
    print(n * 2)
    # 1 = 1*2 = 2
    # 2 = 2*2 = 4
    # 3 = 3*2 = 6
# -------------------------
# 辞書
# -------------------------
data = {
    "apple": 100,
    "banana": 200
}
print(data["apple"]) # キー "apple" に対応する値
# -------------------------
# 辞書＋ループ
# -------------------------
data = {
    "A": 10,
    "B": 20
}
for key in data:
    print(key, data[key])
# -------------------------
# リスト＋ループ
# -------------------------
nums = [1, 2, 3, 4]
result = []
for n in nums:
    if n % 2 == 0:
        result.append(n)
print(result)